# Задача № 1

# tpl = ('ab', 'abcd', 'cde', 'abc', 'def')
# print('Поиск заданного элемента в кортеже')
# print('Исходный кортеж:', tpl)
# s = input('\ns = ')
# if s in tpl:
#     print('Yes')
# else:
#     print('No')

# Задача № 2

# print('Введите статистику частотности символов в кортеже')
# tpl = tuple(input('\nВведите по порядку, без пробелов, элементы кортежа: '))
# print(tpl)
# s = set(tpl)
# tpl_el = tuple(s)
# for i in tpl_el:
#     print('Количество', i, '=', tpl.count(i))
